wsarachai/smartfarm/pump-zone/sdkconfig.defaults
# pump-zone — reproducible ESP-IDF build defaults. Generic parity keys shared
# with the sibling ESP-IDF projects; only the settings that matter are pinned
# here, everything else is left to IDF defaults. Do NOT paste the full generated
# sdkconfig into this file.

# Target SoC: ESP-WROOM-32 (Xtensa dual-core).
CONFIG_IDF_TARGET="esp32"

# Single-app partition layout (no OTA slots); partition auto-sizes to flash.
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# 4MB flash to match real ESP-WROOM-32 devkits.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# 160 MHz CPU.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# 100 Hz FreeRTOS tick.
CONFIG_FREERTOS_HZ=100

# INFO-level logging.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Browser requests can include long headers (cookies, sec-ch-ua, etc.).
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=1024
